test/unit/p2d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       52;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       60;
    }
    side1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4;
        startFace       68;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  side2;
    }
    side2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4;
        startFace       72;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  side1;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          64;
        startFace       76;
    }
)

// ************************************************************************* //
